{"inkVersion":21,"root":[["^The store was still lit like the area outside, but you can’t see or hear anyone.","\n","^The scale of the convenience store is both impressive and puzzling, considering its localized entirely within a circus tent.","\n","^Just goes to show the popularity of clowning, that it can justify a space like this.","\n","^Though it feels absurd, taking in the rows of products. They really did just place a whole convenience store in here.","\n","^It has everything you’d expect. Trusty snacks, rows of energy drinks… Even items like cleaning supplies, matches and… kitchen knives? When would anybody have use for all of this during a performance?","\n","^Lost in thought, you inspect some cheaply made beauty products by the register. Your browsing was sharply interrupted by a shrill shriek.","\n","^Oh, shit, I mean- uh, hi, welcome to Under lOOO, where everything costs Under lOOO! How can I help, beloved customer? …Wait, is it “dear customer?” “Valued customer?” Oh god, I thought we were closed for the public I’m too tired for this. ","#","^speaker: question ","/#","#","^sprite: call","/#","\n","^The uniformed clown’s voice was shaky, making her introduction sound more like a plea than a welcome.","\n","^Don’t worry, I’m not buying anything. You’re closed, after all. ","#","^speaker: player","/#","\n","^She sighed in relief, though her shoulders remained tense.","\n","^Thank god. I thought I was sleeping on the job for a second. Wait, if we’re closed, how’d you get in…? ","#","^speaker: question ","/#","#","^sprite: neutral","/#","\n","^Don’t worry about it. ","#","^speaker: player","/#","\n","^So… you’re really not a customer? ","#","^speaker: question ","/#","#","^sprite: call","/#","\n","^You nod, and she slumps into the chair behind the register.","\n","^You scared me, but at least I’m awake again. There’s always work left to do, I shouldn’t have gone to bed anyway. ","#","^speaker: question ","/#","#","^sprite: neutral","/#","\n","^“Gone to bed”? …Where? ","#","^speaker: player","/#","\n","^She points to some shelves behind the register.","\n","^You didn’t notice before, but there’s a wrinkled, horrifically blue Under lOOO branded sleeping bag underneath.","\n","^A single stuffed animal, looking to be some kind of pop culture character, is carrying the burden of giving the space a single twinge of homeliness.","\n","^You actually have no idea what to say. Somehow, she’d made a mattress on the floor seem like peak comfort.","\n","^It’s not that bad once you get used to it. ","#","^speaker: question ","/#","#","^sprite: neutral","/#","\n","^… ","#","^speaker: player","/#","\n","^…No, you’re right. It is still that bad once you get used to it. ","#","^speaker: question ","/#","#","^sprite: neutral","/#","\n","^… ","#","^speaker: player","/#","\n","^At least I don’t have to pay for it? ","#","^speaker: question ","/#","#","^sprite: call","/#","\n","^… ","#","^speaker: player","/#","\n","^I know it looks bad, but… …No, I have nothing, actually. ","#","^speaker: question ","/#","#","^sprite: neutral","/#","\n","^If you want, we could go somewhere, the two of us. You could crash at my place for a few nights after. ","#","^speaker: player","/#","\n","^Sorry. Sounds nice, but I’m all out of vacation hours. I’d rather restock the shelves fast, so I can go back to bed. If you’re not buying, I… think it’s best for you to leave. My boss isn’t friendly to people without money to spend. ","#","^speaker: question ","/#","#","^sprite: call","/#","\n","^This would be harder than you’d initially assumed. The offer wasn’t even entirely to ask her out.","\n","^Her living situation, if you’re willing to stretch that to include a bag on a convenience store floor, is so absurd. Yet she shot down a chance to not break her spine for a night.","\n","^You’d need to take this slow, ease her nerves.","\n",{"->":"Choices"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Choices":[["ev","str","^Can I help you?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Then I'll buy something","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"Good"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Bad"},"\n",{"#f":5}]}],{"#f":1}],"Good":["^But my boss- ","#","^speaker: question ","/#","#","^sprite: call","/#","\n","^She doesn’t have to know ;) ","#","^speaker: player","/#","\n","^She will! ","#","^speaker: question ","/#","#","^sprite: call","/#","\n","^So much for easing her nerves. She frantically scans the room, though it’s completely empty except for the two of you. As if it's haunted with ghosts only she could see.","\n","^Her panic fades however, when met with boxes upon boxes of products, unopened and unsorted. Stress falls to exhaustion, and with it, resignation.","\n","^Okay…, if you’re offering, then… Maybe more sleep would be good for me. ","#","^speaker: question ","/#","#","^sprite: neutral","/#","\n",{"->":"Scene2"},{"#f":1}],"Bad":["ev",{"VAR?":"wrongChoices"},1,"+","out","/ev","\n","^god fucking damn it ","#","^speaker: question ","/#","#","^sprite: angi","/#","\n","^You put a chocolate bar on the register. It moves down painfully slowly. You have never before in your life seen somebody eye a candy bar with such despair on their face. It inches closer to her. This is torture for your concsience.","\n","^You can’t imagine how much worse it is for the clown. She picks it up like it was fifty times its weight, her gaze equally as heavy.","\n","^How could you do this to her. A single beep rings out. Remy winces at the noise. This is your fault.","\n","^That'll be……. lOO kroner……… ","#","^speaker: question ","/#","#","^sprite: neutral","/#","\n","^Her voice shook. This was perhaps the worst decision you’ve ever made. Tapping your card was only a confirmation of your sins.","\n","^You have to repent.","\n",{"->":"Good"},{"#f":1}],"Scene2":["^... ","#","^background: under1000","/#","\n","^Your plan for the night hadn’t included unpacking a near sisyphean amount of cardboard. You’d lost track of time, and there was no clock or window to judge from.","\n","^Though it must be past midnight. Yet, the cardboard boxes seemed endless. If forced to do this repeatedly, with only the faint buzzing of freezers and ceiling lights in your ears, you might go insane.","\n","^Wow! We’ve made so much progress! ","#","^speaker: question ","/#","#","^sprite: neutral","/#","\n","^Exactly how long does it usually take her?","\n",{"->":"Choices2"},{"#f":1}],"Choices2":[["ev","str","^We need to be faster. I'm tired.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^How often do you do this?","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"Bad2"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Good2"},"\n",{"#f":5}]}],{"#f":1}],"Bad2":["ev",{"VAR?":"wrongChoices"},1,"+","out","/ev","\n","^Sorry, I’m being slow. I’m terrible at this. I’m actually kind of useless. You should just leave. I can do this by myself, really, you can lea- ","#","^speaker: question ","/#","#","^sprite: call","/#","\n","^You make the decision to interrupt before she completely ruins her own self-esteem.","\n",{"->":"Good2"},{"#f":1}],"Good2":[["^And how are you not deranged yet because of it? ","#","^speaker: player","/#","\n","^I don’t think I kept track? I tried bringing it up to my boss once- ","#","^speaker: question ","/#","#","^sprite: call","/#","\n","^Her voice lowered to a near whisper, and she looked over her shoulder before turning back to her cardboard abyss.","\n",["^but she said something about “building character”, and “being a team player”. And it’s not like I can prove her wrong. ","#","^speaker: question ","/#","#","^sprite: angi","/#","\n","^You keep talking about your boss. What about you? ","#","^speaker: player","/#","\n","^The question seemed to freeze her, stopping dead in her tracks.","\n",{"->":"Choices3"},{"#f":5,"#n":"g-0"}],null],{"#f":1}],"Choices3":[["ev","str","^What's your name?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^What's your type?","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"Good3"},"\n",{"#f":5}],"c-1":[{"->":"Bad3"},"\n",{"#f":5}]}],{"#f":1}],"Bad3":["ev",{"VAR?":"wrongChoices"},1,"+","out","/ev","\n","^I, uh… Haven’t thought about it? I haven’t talked to someone who isn’t a co-clown or customer in… Huh. I can’t remember. ","#","^speaker: question ","/#","#","^sprite: neutral","/#","\n","^Okay, maybe reassess your priorities. This case seems… unique.","\n",{"->":"Good3"},{"#f":1}],"Good3":[["^If she was just shocked to be asked, or genuinely needed a few moments to remember her own name, you didn’t know. Both were concerning.","\n","^…Remy. My name is Remy. ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^She said it like the sounds were foreign to her.","\n","^Nice to meet you, Remy. ","#","^speaker: player","/#","\n","^For the first time this evening, something resembling a smile appeared on Remy’s face.","\n","^Time passes, while the boxes grow emptier and the shelves full. It even looked like the end might be near.","\n","^While Remy at first glance was best described as… something like a shaken mouse turned unwilling paranormal investigator, you honestly were impressed by her.","\n","^Doing this amount of labour, without losing her mind entirely, wasn’t to be sneezed at.","\n",["^And this amount of gatekeeping is absurd, women have always been part of game history. ","#","^speaker: remi ","/#","#","^sprite: angi","/#","\n","^But the online landscapes are so toxic, which means less women participating, leading to invisibility again. ","#","^speaker: remi ","/#","#","^sprite: angi","/#","\n","^I’d know, I’ve been in multiple tournaments. I even won a lot of them! But the things you hear in online matches… I don’t know where kids learn those words. ","#","^speaker: remi ","/#","#","^sprite: angi","/#","\n","^She’d been going on like this for ages. Not that her engagement bothered you, quite the opposite. There was a spark to her, which you found charmingly contagious.","\n","^…I miss writing my master’s degree. Actually- I just miss caring… ","#","^speaker: remi ","/#","#","^sprite: angi","/#","\n","^Jesus. Maybe your first date should be therapy?","\n","^Why is this place actually the worst. ","#","^speaker: player","/#","\n","^It’s not, really! Maybe top ten, but not the worst. My mom tells me she had it just as bad. ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^Maybe you should bring her mom to therapy, too.","\n","^I have not seen a single window in this building. I think that’s illegal. Did your mom have a fire escape route? ","#","^speaker: player","/#","\n","^…Probably not. ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^Wouldn’t she understand, then? If you asked to stay home for a while? ","#","^speaker: player","/#","\n","^What!? ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^Remy shot you a glance like you’d just suggested murder.","\n","^I- I… can’t do that! I told you, I’m out of vacation hours… ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^Remy’s voice trailed off. You couldn’t help but feel like you’d messed up, after she’d been so passionate.","\n","^She didn’t even speak anymore, disappearing into her repetitive restocking. Her  shift in tone caught you off-guard, joining you to the silent repetition.","\n","^You didn’t want to set off her nerves again, so you used the space to carefully consider your next words.","\n","^You couldn’t drag her out of here, she had to leave with you of her free will. Anything else would be a strange thing to do.","\n","^Unlike all the normal things you do. Like breaking into circuses.","\n","^You reached for another pack of sanitary pads to stock. An electric current shot through you when you touched skin instead.","\n","^Remy squeaked, but didn’t move her hand. So there you were, hand on hand, on a pack of pads.","\n","^You locked eyes. Faint buzz of lights, knees on cold tiled floor, holding the same menstrual product… It was not how you’d predicted your clown romantics to go.","\n","^It was maybe not an inherently romantic setting, but the blush of Remy’s cheeks proved it could be. This was the first time you’d ever call kneeling on a dirty convenience store floor intimate.","\n","^Life never ceases to surprise.","\n",{"->":"Choices4"},{"#f":5,"#n":"g-0"}],null],{"#f":1}],"Choices4":[["ev","str","^Your eyes... They're top tier.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Your uniform is so pretty...","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"Good4"},"\n",{"#f":5}],"c-1":["^  ",{"->":"Bad4"},"\n",{"#f":5}]}],{"#f":1}],"Bad4":["ev",{"VAR?":"wrongChoices"},1,"+","out","/ev","\n","^Thanks…? It’s mandatory… There’s a matching pyjama set. I’m not allowed to sleep without it. ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^Damn it. You complimented the company that deprives her of sleep. Good going. You should find something else to compliment.","\n",{"->":"Good4"},{"#f":1}],"Good4":["^You feel incredibly good about this compliment. And as they say, ignorance is bliss.","\n","^But maybe you and Remy are a match made in heaven, because she scrambled to recollect herself. Your luck should be studied.","\n","^... ","#","^speaker: remi ","/#","#","^sprite: shy","/#","\n","^If she wanted to say something, she was interrupted.","\n","^The sound of a sliding door sent her into high alert, craning her neck to look towards the entrance.","\n","^Quick! Hide! ","#","^speaker: remi ","/#","#","^sprite: call ","/#","#","^music: none","/#","\n","^You decide Remy’s genuine panic is reason enough to sprint behind the shelf you’d been stocking.","\n","^Not the greatest hiding place, but out of sight from the entrance. It would have to do.","\n","^The sound of approaching footsteps echoed unnaturally loud.","\n",{"->":"Scene3"},{"#f":1}],"Scene3":["^The footsteps come to an abrupt end. Followed by the sharp clack of hard material against the tiles.","\n","^You find a small opening between the rows of cleaning products, showing you a glimpse of Remy frozen, her spine rigid. Towering over her, was a woman with a cane planted firmly to the floor.","\n","^G-Good evening, Ringleader. ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^Good evening. I see you’ve been hard at work. I’d say you’ve outdone yourself. ","#","^speaker: ringmaster ","/#","#","^sprite: neutral","/#","\n","^There was not a hint of kindness in her words.","\n","^Yes, I worked really hard! ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^You did? ","#","^speaker: ringmaster ","/#","#","^sprite: neutral","/#","\n","^…Yes! ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^Remy choked out the words. The ringleader arched an eyebrow.","\n","^Listen. I don’t pay and house you, for you to slack off. Or let unemployed strangers loiter around my establishment. ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^I don’t know what you’re talking about… ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^Then I assume this efficiency has set a new bar. And I hope for your sake, it’s one you can reach. ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^Remy opened her mouth, maybe to protest, but couldn’t get a word in.","\n","^This is a business, not a charity. There’s countless of you out there. ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^I know that! I’m grateful, I promise! And you know I can’t lie to you. ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^Poor Remy just stood there, wide-eyed and frozen. You felt it yourself, even with the barrier between you and them.","\n","^The vibes were, as you’d say with wise words; off. You debate whether or not to intervene. But Remy seemed to side-eye you, softly shaking her head.","\n","^The ringleader placed her cane under Remy’s chin, tilting her head to glare directly at her.","\n","^Good. I expect results. Anyone can make empty promises, but they don’t make me money. And dishonesty? ","#","^speaker: ringmaster ","/#","#","^sprite: neutral","/#","\n","^I know… ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^I might see you again tonight. There’s a little rat loose in my building. I trust you’ll tell me if you see her? ","#","^speaker: ringmaster ","/#","#","^sprite: neutral","/#","\n","^Remy nodded. Maybe a little too enthusiastically. If the Ringleader called her bluff, she didn’t choose to pry.","\n","^While I’m here- To maximize appeal to customers, you should consider another color for your outfit. It’s not good on you. ","#","^speaker: ringmaster ","/#","#","^sprite: neutral","/#","\n","^You agreed with the company to make me wear it… ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^What? ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^Nothing! ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^Clearly not rid of suspicions, the Ringleader knocked her cane on the floor again, and left. ","#","^ringmastervisibility: false","/#","\n","^You stayed still until her footsteps disappeared entirely. Carefully peeking out from your hiding spot, you’re not sure what to make of the whole encounter.","\n","^To be honest, you weren’t all that afraid of the Ringleader. Even knowing she was actively looking for you.","\n","^What could she even do? Worst case, you could probably outrun her. You had no proof of this, but you do have belief. And what more do you need?","\n","^Remy, however- Was still as a statue, not having moved an inch, her shoulders high.","\n","^Her phone was held up to her ear, and she was muttering something frantically into it.","\n",{"->":"Choices5"},{"#f":1}],"Choices5":[[["ev",{"^->":"Choices5.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Why is your boss kinda… ",{"->":"$r","var":true},null]}],["ev",{"^->":"Choices5.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Are you okay? ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Choices5.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],{"->":"Bad5"},"\n",{"#f":5}],"c-1":["ev",{"^->":"Choices5.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"Good5"},"\n",{"#f":5}]}],{"#f":1}],"Bad5":["ev",{"VAR?":"wrongChoices"},1,"+","out","/ev","\n","^Why is your boss kinda… ","#","^speaker: player","/#","\n","^Remy seemed to snap back into reality, in complete bewilderment at your horrible, terrible takes.","\n","^What? ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^No, I’m just saying, she could- ","#","^speaker: player","/#","\n","^Please don’t finish that sentence. I can’t deal with this. I can’t take this anymore… ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^It was the most curt you’d ever heard her. It would sting if she wasn’t right. Why did you say that. Why now.","\n",{"->":"Good5"},{"#f":1}],"Good5":["^You shove your own feelings to the side. Whatever was going on here, it’d shaken Remy up.","\n","^Are you okay? ","#","^speaker: player","/#","\n","^She was very obviously not. You didn’t even know why you asked.","\n","^Lips quivering, she grabbed your arm and led you away in a hurry.","\n",{"->":"Scene4"},{"#f":1}],"Scene4":["^... ","#","^background: bathroom","/#","\n","^Remy had dragged you into the Under lOOO girl’s bathroom, locking the door behind you.","\n","^There’d been a lock demanding payment to use it, but Remy’s employee card let her in. Or was it her credit card?","\n","^But you were grateful for a closed space regardless, she looked disheveled enough as is. You really didn’t want her boss barging into her sitting by the sink, head in her hands.","\n","^You pick up a broom to reinforce the door’s lock.","\n","^This is it. It’s over for me. ","#","^speaker: remi ","/#","#","^sprite: call ","/#","#","^music: sad","/#","\n","^Damn.","\n","^What do you even do? You didn’t prepare for returning to service work, and you definitely didn’t prepare to be a clown therapist. You barely have credentials for one of these things.","\n","^You end up awkwardly patting Remy on the shoulder. She sniffles, and it proves your spirit that you don’t make a sound when her nose honks.","\n","^Why do you even care? This place sucks, anyway. ","#","^speaker: player","/#","\n","^It’s not like I want to be here! ","#","^speaker: remi ","/#","#","^sprite: angi","/#","\n","^Then leave? ","#","^speaker: player","/#","\n","^It’s not that simple! If it was, I’d have left ages ago… But it’s not too late for you. ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^You could go with me. ","#","^speaker: player","/#","\n","^I wish... But I have to stay. If I just work harder, then maybe the Ringleader will let me keep my job. ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^But she’s the worst. ","#","^speaker: player","/#","\n","^…But she’s my employer. ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^Why do you insist on staying? There’s other jobs out there. That won’t make you sleep in branded sleeping bags. ","#","^speaker: player","/#","\n","^And none of them want me! Only the Ringleader did, if she takes this away from me, I… I won’t have a job! ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^She pretty much wailed into her hands.","\n","^Don’t you have somewhere to go? I mean it when I say I’ll help, if you can’t go to your parents. ","#","^speaker: player","/#","\n","^If I go with you, my parents will find out. They, everyone, will find out I lost the only job that would have me… How can I face them after that…? How am I supposed to face myself? ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n",{"->":"Choices6"},{"#f":1}],"Choices6":[[["ev",{"^->":"Choices6.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^That would be embarrassing.  ",{"->":"$r","var":true},null]}],["ev",{"^->":"Choices6.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^That’s a them issue.  ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Choices6.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],{"->":"Bad6"},"\n",{"#f":5}],"c-1":["ev",{"^->":"Choices6.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"Good6"},"\n",{"#f":5}]}],{"#f":1}],"Bad6":["ev",{"VAR?":"wrongChoices"},1,"+","out","/ev","\n","^Yeah, that would be embarrassing. ","#","^speaker: player","/#","\n","^Do you ever stop to think before you speak?","\n","^Do you ever consider the consequences of your actions?","\n","^Remy is crying. Remy is crying and it’s your fault.","\n","^How are you supposed to face yourself?","\n","^You scramble to remedy the situation.","\n",{"->":"Good6"},{"#f":1}],"Good6":["^If your parents think that, that’s a them issue. Don’t they want their daughter to be happy? ","#","^speaker: player","/#","\n","^It’s not that! They do want me to be happy. It’s just that… That they also struggled. I can’t waste five years getting degrees, and then fail at what everyone else succeeded in. What does that say about me? ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n",{"->":"Choices7"},{"#f":1}],"Choices7":[[["ev",{"^->":"Choices7.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^That you’re human? ",{"->":"$r","var":true},null]}],["ev",{"^->":"Choices7.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^That you’re stupid? ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Choices7.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],{"->":"Good7"},"\n",{"#f":5}],"c-1":["ev",{"^->":"Choices7.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"Bad7"},"\n",{"#f":5}]}],{"#f":1}],"Bad7":["ev",{"VAR?":"wrongChoices"},1,"+","out","/ev","\n","^You know what? For once, you don’t run your mouth. You pull yourself together, and decide not to be a terrible person.","\n",{"->":"Good7"},{"#f":1}],"Good7":["^That you’re human? Clowns are people too, you know. I’m sorry your boss doesn’t think that way. ","#","^speaker: player","/#","\n","^…She is kind of mean… ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^I think she’s actively ruining your spine. Your boss is evil. ","#","^speaker: player","/#","\n","^Why should you believe anything she tells you about self-worth? Does she know your parents, or what they’ll think of you? ","#","^speaker: player","/#","\n","^Remy’s face cycled through too many emotions for you to catch them all. Whichever thoughts were churning in her mind, looked to be cycling just as fast.","\n","^When she landed, it was not a calm settlement.","\n","^…Y-Yeah! Yeah, why should I listen to her…? I let someone help me one time, because I am so tired, and she gets offended! She doesn’t care about me! But my parents do! ","#","^speaker: remi ","/#","#","^sprite: angi","/#","\n","^…You do. ","#","^speaker: remi ","/#","#","^sprite: shy","/#","\n","^She said it so softly, so hopefully. Remy runs her fingers between yours, holding your hand.","\n","^You gently wipe a tear off her cheek. You accidentally smudge her clown makeup a little. But you don’t care about the facade.","\n","^Remy leans to rest her head on your shoulder, her breath warm to your skin- but then her nose honks.","\n","^Sorry, sorry, sorry- -someone please kill me right now ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^You pull her into a hug, honks and all.","\n","^Remy buried her head in the crook of your neck, letting out a breath.","\n","^How long she’d been forced to hold it, by her boss, by her anxieties, you didn’t know. But it was clearly due time to let it out. And you’d let her stay there, however long she needed.","\n","^... ","#","^background: bathroomdanger ","/#","#","^music: intense","/#","\n","^You’re snapped out of your serenity by the door handle being roughly jostled. Remy jumps back at the sound, quickly covering her mouth to stifle any noise.","\n","^Remy leaned in close to whisper.","\n","^I think she knows we’re here. ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^If you don’t care about losing your job, why are you so worried? What can she even do to you? ","#","^speaker: player","/#","\n","^…You say that like she doesn’t own everything here. I work for her, you’re trespassing, and I let you. We’ve gone against her authority. ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^She grabbed your shoulders, and stared you down.","\n","^She can do whatever she wants. ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^For once, the fear in her words actually got to you. It wasn’t panic. It was pure, concentrated dread. You weren’t afraid, but if Remy was, you had to believe her.","\n","^…What to do… ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^We could wait it out until morning. ","#","^speaker: player","/#","\n","^My boss has a master key. She’s probably going to get it as we speak. ","#","^speaker: remi ","/#","#","^sprite: angi","/#","\n","^The stalls don’t have keyholes, though. ","#","^speaker: player","/#","\n","^…Even I could break down a door that cheaply made. ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^We can break the mirror? ","#","^speaker: player","/#","\n","^??? ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^Use the glass shards as weapons? ","#","^speaker: player","/#","\n","^I think… I don’t want to get convicted for stabbing…? ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^…At least you thought the idea was good.","\n","^I have an idea... Maybe. ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n",{"->":"Scene5"},{"#f":1}],"Scene5":["^... ","#","^background: trashbag ","/#","#","^visibility: false ","/#","#","^music: none","/#","\n","^You find yourself in a black trash bag, surrounded by a strong smell of plastic and (thankfully) clean paper.","\n","^You were blind to the world, the only sound you could hear being the trolley you were carried in.","\n","^Among all the strange happenings tonight, this one might take the cake. But you’d chosen to believe in Remy’s idea.","\n","^If you really could get outside pretending to clean trash, it sounded like the safest option. Better than your ideas, you guessed.","\n","^And Remy’s squeaking shoes already ruined any plan of a stealth mission.","\n","^So you stay still. Waiting.","\n","^She rolls you out of the bathroom. The trolley kept moving.","\n","^Until it stopped.","\n","^You don’t make a sound, nor move. You hadn’t received your signal.","\n","^The back door is locked. ","#","^speaker: remi ","/#","#","^visibility: false","/#","\n","^And so is the front. Look at you. Giving it your all, even at this time of night. ","#","^speaker: ringmaster ","/#","#","^visibility: false","/#","\n","^Ah, fuck.","\n","^Y-Yes, a- ","#","^speaker: remi ","/#","#","^visibility: false","/#","\n","^Remy made a terrified squealing noise.","\n","^I know what you did. I know you led that rat around my building, letting her do work intended for my employees, and then you lied to my face. ","#","^speaker: ringmaster ","/#","#","^visibility: false","/#","\n","^Now you’re helping her scurry away without consequence. Did you forget what you are without me?\t","#","^speaker: ringmaster ","/#","#","^visibility: false","/#","\n","^I’m loved! ","#","^speaker: remi ","/#","#","^sprite: angi ","/#","#","^visibility: false","/#","\n","^…Never say that again. I don’t care what lies the rat sold you. Tell me: where is she? ","#","^speaker: ringmaster ","/#","#","^visibility: false","/#","\n","^What do you do?","\n",{"->":"Choices8"},{"#f":1}],"Choices8":[[["ev",{"^->":"Choices8.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Jump out of the trash bag. ",{"->":"$r","var":true},null]}],["ev",{"^->":"Choices8.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Stay put. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Choices8.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],{"->":"Good8"},"\n",{"#f":5}],"c-1":["ev",{"^->":"Choices8.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"Bad8"},"\n",{"#f":5}]}],{"#f":1}],"Bad8":["ev",{"VAR?":"wrongChoices"},1,"+","out","/ev","\n","^You come to the realization you are a clown enjoyer, not a clown savior. And that you are, potentially, maybe, a little (very) out of your element.","\n","^You stay still where you are.","\n","^After we’re done here, you won’t mind if I take the trash to the incinerator… Do you? ","#","^speaker: ringmaster ","/#","#","^visibility: false","/#","\n","^Actually, nevermind.","\n",{"->":"Good8"},{"#f":1}],"Good8":["^Imagining it less clumsy than it likely was, you burst out of the trash bag. ","#","^background: under1000danger","/#","\n","^... ","#","^visibility: true ","/#","#","^ringmastervisibility: true ","/#","#","^music: intense","/#","\n","^The Ringleader was standing tall, blocking the door you’d planned to escape through. In one hand she was holding Remy’s throat, who tried to claw at her arm- To no avail.","\n","^She didn’t seem surprised at seeing you. Her grip on Remy didn’t lighten, not in the slightest. She only glared like you’d just crawled out of her shower drain.","\n","^Stop! ","#","^speaker: player","/#","\n","^Literally nothing happened. You’re not sure what you expected.","\n","^You, employee, have terrible taste in women. You’re giving up everything I gave you, for this? ","#","^speaker: ringmaster ","/#","#","^sprite: shocked","/#","\n","^It was probably the closest to genuine sympathy towards Remy you’d heard from her. Which was not a high bar to clear, but… Ouch.","\n","^I have other qualities! Unhand her! ","#","^speaker: player","/#","\n","^And who do you think you are? ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^Dragging Remy with her in one hand, she takes long, definitive strides towards you. She harshly slams her cane to the floor.","\n","^First a clack, then a metallic cling at its end revealing… Wait. Fuck, is that a knife? Is there a single law that’s more than a suggestion to this woman?","\n","^You walk into my establishment. You get all sappy with my employees. Worst of all, you do it all without spending anything. You are a waste. And then you feel the right to command me? ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^You try to back away, but find yourself blocked by a wall of useless consumer goods.","\n","^She raised her cane. The metal glints against the harsh lights. Remy’s clawing grows more desperate.","\n","^It is so game over, you think. Which would’ve been an embarrassing final thought. You curse your rotted mind. So much your life doesn’t even flash before your eyes when you close them. You expect to be jabbed by sharp metal. You wait… But it never comes. Instead, you hear a scream.","\n","^You open your eyes to see that Remy had bit down on the Ringleader’s hand, forcing her through reflex to drop her. She falls to the floor, coughing and sputtering.","\n","^You impulsively grab the first item you can reach. It turns out to be one of those kitchen knives! Which would have been great- were it not covered in plastic.","\n","^Beggars can’t be choosers- You throw it at the Ringleader to distract her.","\n","^It stuns her for a second. But you assumed her low growl meant you’d mostly pissed her off. Even more, somehow. Impressive, considering she already wanted you dead.","\n","^You rolled over as she tried to stab you again, just barely dodging the blade. You had your first near-belief in a god, as the cane lodges itself in a bag of flour- instead of your throat.","\n","^You scramble to your feet. You’re about to look for Remy- when you feel something clasp around your arm.","\n","^I- ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","ev",{"VAR?":"wrongChoices"},4,"<=","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"FailedRomance"},{"->":"Good8.95"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"SuccessfulRomance"},{"->":"Good8.95"},null]}],"nop","\n",{"#f":1}],"SuccessfulRomance":[["^She was broken off by an energy drink hitting her square in the head. The dent in the can proved its impact, and the Ringleader’s grip loosed enough for you to rip away. ","#","^ringmastervisibility: false","/#","\n","^Looking to the toss’ source, you see Remy waving.","\n","^Over here! ","#","^speaker: remi ","/#","#","^sprite: angi","/#","\n","^You make a break for it. Catching up to Remy, she grabs your arm to lead you. Together, you run to the sliding door.","\n","^Remy started to rummage through her keychain. When- god damn it- the Ringleader’s loud footsteps inched closer. The energy drink didn’t take her out.","\n","^Be faster!\t","#","^speaker: player","/#","\n","^I’m doing my best! And that’s what matters! ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^With only love in your heart for Remy- she was wrong.","\n","^Because with how the Ringleader’s seething rage seemed to darken the entire room, in spite of the store lights? You would say not getting stabbed is what matters.","\n","^Got it! ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^Hand in hand, you sprint through the door. You don’t look back. You run, past the advertisements, weaving in and out of buildings to hide your trail.","\n","^Your throat burns, and your legs threaten to give way. Remy pulls you into an alley, deeper, until you reach the striped wall of the tent. You shoot her a puzzled look.","\n","^The main entrance’s too obvious. I think we lost her- but The Ringleader will just meet us there. ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^She pulls out one of the Under lOOO branded knives from her pocket, and starts ripping apart the packaging.","\n","^You’re so smart. ","#","^speaker: player","/#","\n","^…Thanks… ","#","^speaker: remi ","/#","#","^sprite: shy","/#","\n","^The knife looked cheaply made, but Remy managed to cut a hole in the tent’s fabric- Which seemed equally as cheap. She tears it-","\n","^... ","#","^background: cg1 ","/#","#","^visibility: false ","/#","#","^music: sad","/#","\n",["^and a beautiful sunrise greets you, washing the dark alleyway in gold.","\n","^Wow… I don’t think I’ve seen the sun in months!","\n","^…It makes my skin feel funny. ","#","^speaker: remi ","/#","#","^visibility: false","/#","\n","^…She sure has a lot of readjustment to do. And you plan to be there for all of it.","\n","^You take the first step, out of the tent’s walls. You reach your hand through, offering it to Remy.","\n","^Remy. Presuming we don’t get stabbed… …Do you want to come home and play Fortynight with me?  ","#","^speaker: player","/#","\n","^She takes it. With two steps of her own, she is outside.","\n","^More than anything. ","#","^speaker: remi ","/#","#","^visibility: false","/#","\n","done",{"#f":5,"#n":"g-0"}],null],{"#f":1}],"FailedRomance":["^... ","#","^visibility: false ","/#","#","^ringmastervisibility: false ","/#","#","^background: death ","/#","#","^music: none","/#","\n","^She was broken off by the loud clang of something heavy hitting the ground. The silence that follows is deafening.","\n","^The continuous buzzing of lights feels near gnawing, as you and the Ringleader see Remy standing awkwardly, now empty-handed. The can she’d thrown, now dented at the floor, hadn’t even reached halfway to its target.","\n","^Well, damn.","\n","^Death had barely been a real concept for you. It was supposedly something so far away, not of your concern until about, 40 or so years from now. And you’d never been proven wrong, until now.","\n","^You think you hear a scream, but your world is fading at the corners. Your warmth bled out of you, and you grew cold against the tiled floor.","\n","done",{"#f":1}],"global decl":["ev",0,{"VAR=":"wrongChoices"},"/ev","end",null],"#f":1}],"listDefs":{}}