{"inkVersion":21,"root":[["^You step foot into the cavernous hall.","\n","^While lit with chandeliers, its space was too grand- it felt like the light could never reach the corners.","\n","^Your shoes echoed too loudly, and the floor felt unnaturally hard against your soles. But you weren’t deterred.","\n","^It rather seemed to pull at you, insistently, curiosity taking the lead.","\n","^While the outside had been ornate, royal-looking, the inside took another route. Near every bit of furniture was sterile white, geometric and angular.","\n","^Abstract paintings line the white, untextured walls. You don't see a single piece of furniture designed to sit on. It seemed more like a soulless museum than a living space.","\n","^Every room you peek into has the same feel to it. Sterile, despite the amount of decor. And so far, you have not heard a soul.","\n","^You even debate leaving, trying your luck somewhere else. That is, until you scale a wide staircase- and hear faint voices.","\n","^You follow the sound, the conversation getting clearer.","\n","^…Y-yes. I understand. I won’t let you down again, Ringleader. ","#","^speaker: remi\t","/#","#","^sprite: call ","/#","#","^visibility: true","/#","\n","^Glad we agree. You’re dismissed. ","#","^speaker: ringmaster ","/#","#","^sprite: neutral ","/#","#","^ringmastervisibility: true","/#","\n","^A sharp clack rings out. You hear somebody quickly approaching.","\n","^Where do you hide?","\n",["^Wait, damn it. There’s nothing but ugly wall decor in this hallway. You find nothing.","\n","^You just stand there, unsure what to do with your hands. Or legs. Or any part of you.","\n","^Great first impression.","\n","^Remy: …!? ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^She looked at you like a deer in headlights.","\n","^Glancing to you, then to the doorframe she’d come from, she mouths something to you. Would’ve been great, if you could tell what it was.","\n","^She signals a shush with her finger to her lips- and scurries off, her shoes squeaking all the while.","\n","^You can’t figure out her deal. But deliberating your options, you decide to go after her. Maybe she could tell you more about this place.","\n","^You barely cross a few metres before a voice booms out.","\n","^You. Stop. ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n",{"->":"Choices1"},["done",{"#f":5,"#n":"g-1"}],{"#f":5,"#n":"g-0"}],null],"done",{"Choices1":[[["ev",{"^->":"Choices1.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Run ",{"->":"$r","var":true},null]}],["ev",{"^->":"Choices1.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Stay Put ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Choices1.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],{"->":"Bad1"},"\n",{"#f":5}],"c-1":["ev",{"^->":"Choices1.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"Good1"},"\n",{"#f":5}]}],{"#f":1}],"Bad1":["ev",{"VAR?":"wrongChoices"},1,"+",{"VAR=":"wrongChoices","re":true},"/ev","^Run to where, exactly? There’s nothing but hallways…","\n",{"->":"Choices1"},{"#f":1}],"Good1":["^You listen. You wouldn’t want to mess up another first impression.","\n","^And who are you? ","#","^speaker: ringmaster ","/#","#","^sprite: angry ","/#","#","^visibility: false","/#","\n","^Hi, uh. I’m- ","#","^speaker: player","/#","\n","^Not what I meant. I’m entitled to know; who do you think you are? And how much did you hear? ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^She was incredibly tall, glaring down at you, with the kind of disgust you’d cast towards a pest animal.","\n","^I don’t know what you’re talking about. ","#","^speaker: player","/#","\n","^Your tone is so casual, so positive it came out sounding strained. Kind of like those annoying vloggers you’d watch at your lowest points.","\n","^Don’t play dumb with me. ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^She takes hold of your shirt collar, and before you can even process what’s happening, she shoves you against the wall.","\n","^The impact rattles through your chest.","\n","^Whoa, maybe don’t go straight into the pinning- ","#","^speaker: player","/#","\n","^The Ringleader’s rage collapsed to a visceral confusion. ","#","^sprite: shock","/#","\n","^…What? ","#","^speaker: ringmaster ","/#","#","^sprite: shock","/#","\n","^I’m just saying I’d at least want your name first- ","#","^speaker: player","/#","\n","^Are you actually stupid? Do I have to spell it out to you? This is a threat.\t","#","^speaker: ringmaster","/#","\n","^She pushed you harder against the wall. (Shock sound)","\n","^Well, this was sure going faster than you’d initially expected, you think to yourself.","\n","^Awfully and incorrectly proud, considering how this will end.","\n","^Do you think embarrassing me, on my property, will get you out of this? I won’t let a liability run loose just because of a pretty face. Tell me; What did you hear? ","#","^speaker: player ","/#","#","^sprite: angry","/#","\n","^You think I’m pretty? ","#","^speaker: player","/#","\n","^For the love of god- Stop talking! ","#","^speaker: ringmaster","/#","\n","^You’d never heard anyone that angry in your entire life.","\n","^She slams her cane to the floor, and when she raises it again, a blade sticks from its end.","\n","^Maybe she wasn’t flirting with you.","\n","^“Why’d you even think that in the first place” is a question you probably should have asked yourself, but didn’t.","\n","^Maybe asking questions before doing things would land you in less situations like this.","\n","^Because now you have a blade to your throat, and have to somehow argue for your survival.","\n",{"->":"Choices2"},{"#f":1}],"Choices2":[[["ev",{"^->":"Choices2.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Threaten to call the authorities ",{"->":"$r","var":true},null]}],["ev",{"^->":"Choices2.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^Ask to be employed??? I guess?? ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Choices2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],{"->":"Bad2"},"\n",{"#f":5}],"c-1":["ev",{"^->":"Choices2.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"Good2"},"\n",{"#f":5}]}],{"#f":1}],"Bad2":["ev",{"VAR?":"wrongChoices"},1,"+",{"VAR=":"wrongChoices","re":true},"/ev","^I’ll call the authorities! ","#","^speaker: player","/#","\n","^Exactly. All the more reason to silence you. ","#","^speaker: player ","/#","#","^sprite: neutral","/#","\n","^Ah, fuck.","\n","^You really think you’ll get away with this? ","#","^speaker: player","/#","\n","^It’s funny you think I won’t. ","#","^speaker: player ","/#","#","^sprite: neutral","/#","\n","^…Okay. She won’t listen to morality. Or the law. What will she listen to?","\n",{"->":"Choices2"},{"#f":1}],"Good2":["^You appeal to the one thing a rich person cares about.","\n","^Uh… What if, I don’t know- I worked for you? Made the circus money? ","#","^speaker: player","/#","\n","^And why should I bother with you? ","#","^speaker: player ","/#","#","^sprite: neutral","/#","\n","^I’m extremely motivated? ","#","^speaker: player","/#","\n","^You gesture to the murder weapon against your skin. The Ringleader looks you up and down.","\n","^Before she can make a decision, a trembling, shrill voice rings out.","\n","^Don’t do it! ","#","^speaker: remi ","/#","#","^sprite: call ","/#","#","^visibility: true","/#","\n","^She was practically vibrating with anxiety, but she stood her ground.","\n","^Clutched in her hand was a fire patterned toy gun, pointed at the Ringleader.","\n","^What, exactly, do you think you’re doing? ","#","^speaker: ringmaster\t","/#","#","^sprite: angry","/#","\n","^What’s right! ","#","^speaker: remi ","/#","#","^sprite: angi","/#","\n","^On the brink of tears, she fired the gun.","\n","^Which would have been a sad attempt at resistance- Did the foam projectile not hit the Ringleader directly in her eye.","\n","^If there is a god, you think- they do pick favourites.","\n","^Forced by bodily reflex, the Ringleader clutches her hand over her eye socket. And you make a break for it. ","#","^ringmastervisibility: false","/#","\n",{"->":"Scene2"},{"#f":1}],"Scene2":["^Remy leads you into one of the soullessly decorated side rooms, seemingly picked at random, and slams the door shut after you. ","#","^background: entry","/#","\n","^A quick scan of the space finds you an uncomfortable-looking chair, which you barricade the door with.","\n","^A temporary solution, but it would buy you time.","\n","^Thanks, back there. You have insane aim. ","#","^speaker: player","/#","\n","^Don’t thank me… I think I’ve just put us both in danger. ","#","^speaker: remi\t","/#","#","^sprite: neutral","/#","\n","^She said it slowly, like each word came with a realization of her actions.","\n","^I’ve been in danger before, and it always turned out fine in the end. I think we’re good. ","#","^speaker: player","/#","\n","^No! Do you understand what you asked for? Why did I even do that… You’re screwed…! And so am I! ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^Calm down, it can’t be that bad. ","#","^speaker: player","/#","\n","^She made a confused, sputtering noise.","\n","^Like she wanted to say something, but hadn’t decided on what.","\n","^Yet you were so impossible to comprehend, she physically couldn’t stay quiet.","\n","^You should almost be impressed with yourself. Almost.","\n","^My boss threatened to murder you! It’s worse! ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^You shrug.","\n","^Wouldn’t be the first time. ","#","^speaker: player","/#","\n","^Remy gave you a blank, baffled look.","\n","^Why does everything you say just panic her more.","\n","^If we just get out of the building, we’re fine, right? ","#","^speaker: player","/#","\n","^Oh my god. How is this woman real ","#","^speaker: remi","/#","\n","^I don’t know what kind of life you live. But don’t you understand? This isn’t a street robbery. ","#","^speaker: remi  ","/#","#","^sprite: neutral","/#","\n","^She nervously pinches each of your shirt sleeves, to direct your eyes onto her.","\n","^As some prayer, for you to actually see the grave seriousness in her gaze.","\n","^My boss, the Ringleader- She owns everything and everyone here. ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^Her family? They own even more. And with their kind of money, and their connections, laws are just a price that can be paid. ","#","^speaker: remi","/#","\n","^Either she owns you, or she buries you. Either way, she’s going to get away with it. ","#","^speaker: remi","/#","\n","^You make a wide, frustrated gesture with your arms.","\n","^I didn’t even do anything! ","#","^speaker: player","/#","\n","^Trust me… You don’t need to “do anything”. ","#","^speaker: remi","/#","\n","^One time she went off on me because I blinked too slowly, and it made me look “too tired”, and “unwelcoming to customers”... ","#","^speaker: remi","/#","\n","^You trespassed onto her property, walked into her home, and embarrassed her. And she thinks you’re going to rat her out.\t","#","^speaker: remi\t","/#","#","^sprite: neutral","/#","\n","^So what you’re trying to say is- ","#","^speaker: player","/#","\n","^It’s hopeless. ","#","^speaker: remi\t","/#","#","^sprite: call","/#","\n","^…Damn. ","#","^speaker: player","/#","\n","^You sit there in silence.","\n","^Both of you know there’s no time to, but you can’t think of anything.","\n","^Remy was rubbing her temples, but if she was thinking of a plan, or just panicking- you couldn’t tell.","\n","^There was only one door out… Which also happened to be your one line of defense.","\n","^Okay, what about this; I find your boss and keep her distracted. You said it yourself, she probably hates me more than you. Stay here for about half an hour, and then run. ","#","^speaker: player","/#","\n","^There’s no point… She’ll find me anyway! ","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^Not if I change her mind! ","#","^speaker: player","/#","\n","^I… Don’t want to sound rude… But you? ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^Listen, you have to hear me out. ","#","^speaker: player","/#","\n","^??? ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^She thinks I’m pretty. ","#","^speaker: player","/#","\n","^Remy seemed to collapse, and her head fell to her knees.","\n","^She curled herself together, like not seeing, or hearing, the situation would make it disappear.","\n","^I’m done for. This is actually how it ends. It’s over\t","#","^speaker: remi ","/#","#","^sprite: call","/#","\n","^What do you suggest we do? Give up? ","#","^speaker: player","/#","\n","^Why not…? ","#","^speaker: remi ","/#","#","^sprite: neutral","/#","\n","^But you didn’t do that, just a few minutes ago.  ","#","^speaker: player","/#","\n","^That was…! I don’t know! You didn’t come after me. I’ve seen things, I’ve heard whispers among the clowns. This time it felt like I could… I don’t know? Make a difference? ","#","^speaker: remi\t","/#","#","^sprite: call","/#","\n","^That’s brave of you. ","#","^speaker: player","/#","\n","^And look at where it got me… ","#","^speaker: remi\t","/#","#","^sprite: neutral","/#","\n","^Do you want to try again? If you’re already screwed, at least run until you’re caught. Who knows? It might turn out fine. You’ll never know if you don’t try. ","#","^speaker: player","/#","\n","^Remy peeked out over her arms.","\n","^She won’t look at you, but stares off into space, as if her mind is someplace else. Perhaps somewhere kinder.","\n","^Okay.\t","#","^speaker: remi\t","/#","#","^sprite: angi","/#","\n","^She uncurls from her defensive little shell.","\n","^She stands up, as rigidly and proudly as she’s capable of.","\n","^Which isn’t much, not on the surface. But resolve shone through her anxiety.","\n","^You’re probably going to die, but… Good luck? ","#","^speaker: remi\t","/#","#","^sprite: neutral","/#","\n","^Her ominous prophecy causes you no bother.","\n","^You casually wave to her on your way out.","\n","^Remy returned the gesture, but hers was a true sign of farewell. ","#","^visibility: false","/#","\n","^And maybe it would be the last time you’d ever see her. But you don’t let the thought plant itself.","\n","^You choose to trust in the power of belief. Because that’s what you think has kept you alive.","\n","^After all, reality is relative.","\n","^Once you step out of the door, you hear the shuffle of the barricade being set up again. You had to cause the distraction as far from Remy as possible. You’d come here with the intent on romantic clown antics. But you figure your priorities have shifted. Now your sights were set on the biggest clown of them all; a rich person.","\n",{"->":"Scene3"},{"#f":1}],"Scene3":["#","^background: hallway","/#","^You found yourself once again wandering the empty, strangely uncanny halls. Your shoes against the hard floor echoes, and you occasionally make your steps heavier than usual.","\n","^It’s still too quiet.","\n","^You bury the impulse to go back to Remy, to check on her. You can’t lead the Ringleader right to her.","\n","^After more silent wandering, you start to think you’ve gotten lost. How many rooms could one person possibly need?","\n","^Corridor after corridor, you lose yourself in minimalist interior. Until- You hear another set of footsteps.","\n","^Sounds of hard material against smooth floor, not a single squeak of clown shoes.","\n","^There you are. ","#","^speaker: ringmaster\t","/#","#","^sprite: neutral ","/#","#","^ringmastervisibility: true","/#","\n","^She met you at a crossroads.","\n","^Her tone was polite, cold. Too calm, knowing what you’d allegedly done to offend her.","\n","^You could hear it in the strained gaps between the words. You could hear the cracks in the performance.","\n","^You take a couple of steps back, selling the illusion of fear.","\n","^It’s bold of you. You escape me, and then choose to infest my property further. ","#","^speaker: ringmaster","/#","\n","^She approached you, slowly. For each stride of hers, you take a small step backwards.","\n","^She catches up with ease.","\n","^Where is my employee? ","#","^speaker: ringmaster","/#","\n","^What do you say?","\n",{"->":"Choices3"},{"#f":1}],"Choices3":[[["ev",{"^->":"Choices3.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Not telling. ",{"->":"$r","var":true},null]}],["ev",{"^->":"Choices3.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^She left me behind. ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Choices3.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],{"->":"Bad3"},"\n",{"#f":5}],"c-1":["ev",{"^->":"Choices3.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"Good3"},"\n",{"#f":5}]}],{"#f":1}],"Bad3":["ev",{"VAR?":"wrongChoices"},1,"+",{"VAR=":"wrongChoices","re":true},"/ev","^Maybe going “nuh-uh” to a woman with a murder weapon on her… wasn’t the smartest.","\n","^You’d just made her angrier. Quickly, you scrambled to make up a lie she’d like.","\n",{"->":"Choices3"},{"#f":1}],"Good3":["^The Ringleader seemed content with this information.","\n","^How unfortunate. ","#","^speaker: ringmaster ","/#","#","^sprite: neutral","/#","\n","^The only resemblance to empathy in her voice was a smidge of… pity?","\n","^Not a kind pity, but one that looked down upon you.","\n","^Then let’s get back to where we left off. I have carefully thought about your offer. And if I might lose an employee, that opens a space for you. ","#","^speaker: ringmaster ","/#","#","^sprite: neutral","/#","\n","^And what if I say no? ","#","^speaker: player","/#","\n","^Did she look hurt? You think so, but you also didn’t realize she was threatening you before she pulled out a blade.","\n","^You do understand your options?\t","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n",{"->":"Choices4"},{"#f":1}],"Choices4":[[["ev",{"^->":"Choices4.0.0.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Do you understand your options? ",{"->":"$r","var":true},null]}],["ev",{"^->":"Choices4.0.1.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^…No? ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Choices4.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.0.s"},[{"#n":"$r2"}],{"->":"Good4"},"\n",{"#f":5}],"c-1":["ev",{"^->":"Choices4.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.1.s"},[{"#n":"$r2"}],{"->":"Bad4"},"\n",{"#f":5}]}],{"#f":1}],"Bad4":["ev",{"VAR?":"wrongChoices"},1,"+",{"VAR=":"wrongChoices","re":true},"/ev","^...No?","\n",{"->":"Good4"},{"#f":1}],"Good4":["^She breached into your personal space, still slow and controlled, overcompensating to cover the cracks.","\n","^As if she was trying to convince herself of her composure, just as much as you.","\n","^Let me be blunt, since it took you so long last time. ","#","^speaker: ringmaster ","/#","#","^sprite: neutral","/#","\n","^She takes a hold of you again, but instead of your shirt, she clasps her hand around your throat. Not enough to choke you, but enough to prove she could.","\n","^Enough to strain your breathing, but not enough to hamper your voice. Unfortunately for her, your greatest talent is yapping.","\n","^Either I keep you, or I have to get rid of you.\t","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^Her grip on you stayed rigid. Yet, her fingertips shifted against the skin of your neck, more than they needed to.","\n",{"->":"Choices5"},{"#f":1}],"Choices5":[["^What do you say?","\n",["ev",{"^->":"Choices5.0.2.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":18},{"s":["^Didn’t know you were into that ;) ",{"->":"$r","var":true},null]}],["ev",{"^->":"Choices5.0.3.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-1","flg":18},{"s":["^But is that what you want? ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"Choices5.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.2.s"},[{"#n":"$r2"}],{"->":"Bad5"},"\n",{"#f":5}],"c-1":["ev",{"^->":"Choices5.0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.3.s"},[{"#n":"$r2"}],{"->":"Good5"},"\n",{"#f":5}]}],{"#f":1}],"Bad5":["ev",{"VAR?":"wrongChoices"},1,"+",{"VAR=":"wrongChoices","re":true},"/ev","^Didn’t know you were into that. I mean, I definitely don’t mind, but- ","#","^speaker: player","/#","\n","^Shut up! For the love of god! ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^You probably shouldn’t have said that.","\n","^The near panicked rage in the Ringleader tightened her hand’s grip around your throat, as if on defensive instinct.","\n","^You could still breathe, but not without struggle. You had to change the tides, quickly.","\n",{"->":"Good5"},{"#f":1}],"Good5":["^But is that what you want?","\n","^Despite the Ringleader’s unflinching chokehold on you, it was her who couldn’t get words out.","\n","^If she didn’t know what to say, or was too afraid to say it, you couldn’t tell. But you seemed to have met a verbal roadblock.","\n","^So if you couldn’t convince her with words, then…","\n","^You reach out to her, without hurry.","\n","^She could likely choke the life out of you whenever she wanted, but when your index touched the soft skin by her jawline…","\n","^She didn’t let go of you, but the cracks had grown too wide, too deep, and now it all came crashing down.","\n","ev",{"VAR?":"wrongChoices"},3,"<","/ev",[{"->":".^.b","c":true},{"b":["\n",{"->":"SuccessfulRomance"},{"->":"Good5.21"},null]}],[{"->":".^.b"},{"b":["\n",{"->":"FailedRomance"},{"->":"Good5.21"},null]}],"nop","\n",{"#f":1}],"SuccessfulRomance":[["^How dare you do this to me. ","#","^speaker: ringmaster ","/#","#","^sprite: shock","/#","\n","^You couldn’t tell if her voice was shaking with fury, or fear.","\n","^But she let you touch her.","\n","^But, kind of like a rescue cat. Maybe all those kitten rescue videos got to your head, making you think this could work like that. And you weren’t even proven wrong?","\n","^It’s now or never, you think. You stand on your toes, finally level with her. And she lets go of your throat.","\n","^When she kissed you, you didn’t expect to like it as much as you did.","\n","^Your type wasn’t strictly clowns, it turns out.","\n","^Not that wrapping your arms around a criminal business owner, who’s deliberating murder, was much better. It’s far worse actually.","\n","^Seriously, why are you like this?","\n","^Work for me. Let me keep you. ","#","^speaker: ringmaster\t","/#","#","^sprite: blush","/#","\n","^A significant part of you was already missing her grip on you. But it’s a step in the right direction, proving your… “Boldness”, to put it in kind words.","\n","^That’s… Not how this works. ","#","^speaker: player","/#","\n","^Because you know so much about normal romance.","\n","^Just ask me out? ","#","^speaker: player","/#","\n","^But I’m not… I’m not like that.\t","#","^speaker: ringmaster ","/#","#","^sprite: blush","/#","\n","^You just kissed me??? ","#","^speaker: player","/#","\n","^That doesn’t mean I’m... Do I look like someone who falls asleep thinking of women? \t","#","^speaker: ringmaster ","/#","#","^sprite: shock","/#","\n","^You.. kind of really do, actually. I thought it was on purpose? ","#","^speaker: player","/#","\n","^I’m- I’m not- ","#","^speaker: ringmaster\t","/#","#","^sprite: shock","/#","\n","^You’d broken her.","\n","^She held onto your shoulders like your skin burned to touch, but you’d slip away forever if she let go- And it was tearing her from the inside.","\n","^It sort of impressed you, you’d never met someone this deep in the closet before. Lucky that your taste is concerning enough to break it open.","\n","^Most sane people would’ve run away at the first murder threat. Not stick around for a second one?","\n","^Nobody has to know. Nobody can know. ","#","^speaker: ringmaster ","/#","#","^sprite: blush","/#","\n","^So you’re going to get rid of me? ","#","^speaker: player","/#","\n","^So people don’t know who you really are? So you aren’t held accountable? So you can lie to yourself? ","#","^speaker: player","/#","\n","^As if there exists another option. ","#","^speaker: ringmaster\t","/#","#","^sprite: angry","/#","\n","^What about not being an ass? Like, is this all there is to you? There’s more to care about than numbers. ","#","^speaker: player","/#","\n","^Is there, now? You can care about these things. I’m trying to run a business. I am the numbers. ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^You hook your fingers under her shirt, and pull her towards you.","\n","^You couldn’t let it show, as you didn’t want her thinking you were laughing at her- But it was kind of charming to you how flustered it made her.","\n","^I’m sorry you think this isn’t a part of you. And I’m sorry you’ve been told a part of yourself is unprofitable. ","#","^speaker: player","/#","\n","^Most of all, I’m sorry for the people who are afraid to be unprofitable to you. ","#","^speaker: player","/#","\n","^You assumed both your thoughts went to her employees.","\n","^It felt like you were watching her internal world collapse, moment by moment.","\n","^Suddenly, you swore you could see the same fear you’d seen in Remy, glint ever so slightly in the Ringleader.","\n","^You watched as the untouchable top of the chain realized, an even bigger, more cruel and cold beast already had its jaws around her.","\n","^That she was not perfect to it, and never would be.","\n","^You can live sucking up to profit if you want. But don’t be shocked if you lie awake at night, thinking of what you could’ve had. ","#","^speaker: player","/#","\n","^The silence is thick, near suffocating. You can see it crush her.","\n","^Once again, the power of your yapping is proven unmatched. Not that you ever doubted it.","\n","^Would you even have me?\t","#","^speaker: ringmaster ","/#","#","^sprite: blush","/#","\n","^It was the first time she’d asked a question, and left the following silence truly, genuinely open. No insult, no threat veiled under a question mark.","\n","^If you can prove you’re going to change. Not just you, but everything you can. ","#","^speaker: player","/#","\n","^She sealed the deal with another kiss. You hoped she was serious, because you could get used to this.","\n","^Where do I even begin? ","#","^speaker: ringmaster ","/#","#","^sprite: blush","/#","\n","^Well, I know of somebody who deserves an apology. ","#","^speaker: player","/#","\n",["^Actually, there’s a lot. I’ve just only met one… But it’s a start? ","#","^speaker: player","/#","\n",{"->":"Epilogue"},{"#f":5,"#n":"g-0"}],null],{"#f":1}],"Epilogue":["^... ","#","^background: cgwindow ","/#","#","^ringmastervisibility: false","/#","\n","^Warm sunshine falls on your face through your apartment’s window. You fight to get onto your knees, the white covers rustling quietly.","\n","^A comically loud yawn escapes you as you stretch your arms.","\n","^You’re up. About time. ","#","^speaker: ringmaster ","/#","#","^background: cgringmastermain","/#","\n","^You scooch over to her, your backs against your bedframe.","\n","^I think you’re just too early, Aslaug. ","#","^speaker: player","/#","\n","^Aslaug set her phone to the side, and you rest your head in the crook of her neck. You glance at her phone screen, a familiar face by an article headline.","\n","^Was that Remy? Looks like she’s doing well. ","#","^speaker: player","/#","\n","^…Have you heard from her directly? How is it, with the union established? ","#","^speaker: ringmaster","/#","\n","^I don’t know, she barely talks to me. Too close to you, I guess… I don’t think she’ll ever forgive, y’know? ","#","^speaker: player","/#","\n","^My apology is hers to decide what to do with. If I know she’s safe, that’s enough. ","#","^speaker: ringmaster","/#","\n","^She kisses your forehead.","\n","^I have to go. They’re expecting me at the nonprofit. ","#","^speaker: ringmaster","/#","\n","^As usual. Good luck. ","#","^speaker: player","/#","\n","^Her arm slips through your outreached hand as she gets out of bed, your palms resting against each other for a moment.","\n","^Love you. ","#","^speaker: ringmaster","/#","\n","^Love you too. ","#","^speaker: player","/#","\n","done",{"#f":1}],"FailedRomance":["^So if you couldn’t convince her with words, then…","\n","^You reach out to her, without hurry.","\n","^She could likely choke the life out of you whenever she wanted, but when your index touched the soft skin by her jawline… She didn’t let go of you, but the cracks had grown too wide, too deep, and now it all came crashing down.","\n","^I can’t. ","#","^speaker: ringmaster ","/#","#","^sprite: shy","/#","\n","^So, what? You think this won’t happen again?","\n","^You don’t understand, this isn’t about my feelings! If this gets out- My shareholders, my family… ","#","^speaker: ringmaster\t","/#","#","^sprite: shock","/#","\n","^Her desperate grip on your throat slacked, and you could finally breathe freely.","\n","^Maybe you’ve done it, you thought.","\n","^Her eyes closed for a second. You heard her exhale, all her panic dissipating with it. You thought you’d won.","\n","^Until she opened her eyes again.","\n","^And you could sense only icy clarity.","\n","#","^background: dangerhallway","/#","^She grabbed a hold of you, harder than she’d ever done before, and she threw you to the floor. Your back hits the blank rock.","\n","^The impact momentarily rips the breath out of you, and you scramble to get your aching body up.","\n","^But you only get knocked down, pinned harshly to the floor by a boot sole.","\n","^If this happens again, I have already proved I can’t give in. ","#","^speaker: ringmaster ","/#","#","^sprite: angry","/#","\n","^Her cane slams to the ground. Once more, it reveals the hidden blade. She raises it above you.","\n","^... ","#","^background: nothing ... ","/#","#","^ringmastervisibility: false","/#","\n","^Goodbye. ","#","^speaker: ringmaster","/#","\n","^In your last moments, you swear her farewell sounded sorrowful.","\n","^If it was for you, or simply for a part of herself, you’d never know.","\n","^But you wondered, as the world went dark.","\n","done",{"#f":1}],"global decl":["ev",0,{"VAR=":"wrongChoices"},"/ev","end",null],"#f":1}],"listDefs":{}}